src/toir_cf/src/Documents/торо_АнализКоренныхПричин/торо_АнализКоренныхПричин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_АнализКоренныхПричин</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.торо_КоренныеПричиныДефектов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументовАнализаПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КоренныеПричины</name>
    <attributes>
      <name>ТекстБлока</name>
      <type>
        <types>CatalogRef.торо_КоренныеПричиныДефектов</types>
        <types>CatalogRef.торо_ПричиныДефектов</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДБлока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДРодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗаключение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерУровня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстБлокаЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстБлокаЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректирующиеМероприятия</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДМероприятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задание</name>
      <type>
        <types>BusinessProcessRef.Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/InformationRegisters/торо_КоренныеПричиныДефектов/торо_КоренныеПричиныДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_КоренныеПричиныДефектов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НепосредственнаяПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КореннаяПричина</name>
    <type>
      <types>CatalogRef.торо_КоренныеПричиныДефектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписаниеЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДефектОписаниеЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранениеЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранениеЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТиповойДефект</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоследствияДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследствияДефектаЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследствияДефектаЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_СтатусыДокументовАнализаПричин/торо_СтатусыДокументовАнализаПричин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументовАнализаПричин</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>АнализВыполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Documents/торо_АнализКоренныхПричин/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем БезусловнаяЗапись Экспорт;	// Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("Структура") И ТипЗнч(Основание.Основание) = Тип("Соответствие") Тогда
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание.Основание, ЭтотОбъект);	
		торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(Основание.Основание, ЭтотОбъект);
	Иначе
		торо_ЗаполнениеДокументов20.ЗаполнениеНаОсновании(Основание, ЭтотОбъект, Ложь);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ Статус = Перечисления.торо_СтатусыДокументовАнализаПричин.АнализВыполнен
		И НЕ Статус = Перечисления.торо_СтатусыДокументовАнализаПричин.Закрыт Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ в статусе ""%1"" не может быть проведен.'"), Статус);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	Иначе
		// регистр торо_КоренныеПричиныДефектов
		Движения.торо_КоренныеПричиныДефектов.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_АнализКоренныхПричинКоренныеПричины.ТекстБлока КАК ТекстБлока,
		               |	торо_АнализКоренныхПричинКоренныеПричины.ИДРодителя КАК ИДРодителя
		               |ПОМЕСТИТЬ ТабличнаяЧасть
		               |ИЗ
		               |	Документ.торо_АнализКоренныхПричин.КоренныеПричины КАК торо_АнализКоренныхПричинКоренныеПричины
		               |ГДЕ
		               |	торо_АнализКоренныхПричинКоренныеПричины.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабличнаяЧасть.ТекстБлока КАК ТекстБлока
		               |ИЗ
		               |	ТабличнаяЧасть КАК ТабличнаяЧасть
		               |ГДЕ
		               |	ТабличнаяЧасть.ИДРодителя = """"
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТабличнаяЧасть.ТекстБлока КАК ТекстБлока
		               |ИЗ
		               |	ТабличнаяЧасть КАК ТабличнаяЧасть
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(ТабличнаяЧасть.ТекстБлока) = ТИП(Справочник.торо_КоренныеПричиныДефектов)";
		Запрос.Установитьпараметр("Ссылка", Ссылка);
		РезЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаНепосредственнойПричины = РезЗапроса[1].Выбрать();
		ВыборкаНепосредственнойПричины.Следующий();
		НепосредственнаяПричина = ВыборкаНепосредственнойПричины.ТекстБлока;
		
		ВыборкаКоренныхПричин = РезЗапроса[2].Выбрать();
		Пока ВыборкаКоренныхПричин.Следующий() Цикл 
			Движение = Движения.торо_КоренныеПричиныДефектов.Добавить();
			Движение.ИДРемонта = ИДРемонта;
			Движение.ОбъектРемонта = ОбъектРемонта;
			Движение.ДатаСобытия = ДатаСобытия;
			Движение.НепосредственнаяПричина = НепосредственнаяПричина;
			Движение.КореннаяПричина = ВыборкаКоренныхПричин.ТекстБлока;
		КонецЦикла;
				
		ИзменитьДанныеВВыявленномДефекте(НепосредственнаяПричина);
	КонецЕсли; 

КонецПроцедуры

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
    МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для каждого Строка Из КорректирующиеМероприятия Цикл
		Если Строка.ИДМероприятия = "" Тогда
			Строка.ИДМероприятия = Новый УникальныйИдентификатор();
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АнализКоренныхПричин.Ссылка КАК Ссылка,
		|	торо_АнализКоренныхПричин.ИДРемонта КАК ИДРемонта
		|ИЗ
		|	Документ.торо_АнализКоренныхПричин КАК торо_АнализКоренныхПричин
		|ГДЕ
		|	торо_АнализКоренныхПричин.Ссылка <> &Ссылка
		|	И торо_АнализКоренныхПричин.ПометкаУдаления = ЛОЖЬ
		|	И торо_АнализКоренныхПричин.ИДРемонта = &ИДРемонта";
	
	Запрос.УстановитьПараметр("ИДРемонта", ИДРемонта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстСообщения = СтрШаблон(НСтр("ru = 'По данному ремонту уже введен документ ""%1""'"), ВыборкаДетальныеЗаписи.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЦикла;
	
	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование = "";
	ДатаСобытия = "";
	ИДРемонта = "";
	ОбъектРемонта = "";
	КраткоеОписание = "";
	Описание = "";
	Комиссия = "";
	ДатаЗавершенияАнализа = "";
	Статус = Перечисления.торо_СтатусыДокументовАнализаПричин.Зарегистрирован;
	КоренныеПричины.Очистить();
	КорректирующиеМероприятия.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ИзменитьДанныеВВыявленномДефекте(НепосредственнаяПричина)

	ДефектОбъект = ДокументОснование.ПолучитьОбъект();
	ДокументИзменен = Ложь;
	Для каждого СтрокаДефекта Из ДефектОбъект.СписокДефектов Цикл
		Если СтрокаДефекта.ID = ИДРемонта И СтрокаДефекта.ДефектПричина <> НепосредственнаяПричина Тогда
			ДокументИзменен = Истина;
			СтрокаДефекта.ДефектПричина = НепосредственнаяПричина;
		КонецЕсли; 
	КонецЦикла; 
	
	Если ДокументИзменен Тогда
		ДефектОбъект.Записать();
		
		НаборЗаписей = РегистрыСведений.торо_ВыявленныеДефекты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументОснование);
		НаборЗаписей.Прочитать();
		Для каждого Строка Из НаборЗаписей Цикл
			Если Строка.ID = ИДРемонта Тогда
				Строка.ДефектПричина = НепосредственнаяПричина;
			КонецЕсли; 
		КонецЦикла;
		НаборЗаписей.Записать(Истина);		
	КонецЕсли; 
КонецПроцедуры 


#КонецОбласти

#КонецЕсли
